#+AUTHOR: BuddhiLW
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage{amsmath, physics}
#+PROPERTY: header-args:clojure :tangle ./src/sicmutils_org/var-mechanics1.clj :mkdirp yes

* Name Space (ns)
#+begin_src clojure :tangle ./src/sicmutils_org/var-mechanics1.clj :mkdirp
    (ns sicmutils-org.var-mechanics1
      (:require [uncomplicate.neanderthal
                 [native :refer [dv dge]]
                 [core :refer [mv mm nrm2 dot axpy]]] ;; => sicmutils.env conflict with :refer pi
                [sicmutils.env :as env]))
  (env/bootstrap-repl!)
#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
 

** Mathematical representations
#+begin_src clojure :tangle ./src/sicmutils_org/var-mechanics1.clj :mkdirp
  (def render (comp ->infix simplify))

  (square (sin (+ 'a 3)))
  ;;=> (expt (sin (+ a 3)) 2)

  (render (square (sin (+ 'a 3))))
  ;;=> "sin²(a + 3)"
#+end_src

#+RESULTS:
| class clojure.lang.Compiler$CompilerException |
| class clojure.lang.Compiler$CompilerException |
| class clojure.lang.Compiler$CompilerException |

** Programming of these concepts

[[https://dragan.rocks/articles/17/Clojure-Linear-Algebra-Refresher-Matrix-Transformations][Matrix algebra]]  knowledge, using neanderthal library,

$T: R^{3} \to R^{2}$ , in which $T(x,y,z) = (f_{1}(x,y,z), f_{2}(x,y,z))$, for example, $T(x,y,z)=(2x,y-z)$.

For $T(1, 4, -2)$, we have $T(x, y, z)=(2*1, 4-(-2)) \Leftrightarrow T(x, y, z)=(2, 6)$.

Let's program this behaviour
#+begin_src clojure :tangle ./src/sicmutils_org/var-mechanics1.clj :mkdirp
  (defn transformation-1 [x]
   (dv (* 2.0 (x 0)) (- (x 1) (x 2))))
#+end_src

#+RESULTS:
: #'sicmutils-org.var-mechanics1/transformation-1

- The *dv* is implemented as a recursive call, and using Intel MKL (Math Kernel Library) to generate a vector.
  + /Syntax/:  $[(x \, n) \Leftrightarrow x_{n}] \, \land  \, [<,> \Leftrightarrow <\textrm{space}>]$
    + in this case, our function-body is structurely similar to $(2*x_{0}, x_{1} - x_{2})$.

#+begin_src clojure :tangle ./src/sicmutils_org/var-mechanics1.clj :mkdirp
  (transformation-1 (dv 1 4 -2))
#+end_src

#+RESULTS:
: #RealBlockVector[double, n:2, offset: 0, stride:1]
: [   2.00    6.00 ]

#+begin_example
: #RealBlockVector[double, n:2, offset: 0, stride:1]
: [   2.00    6.00 ]
#+end_example

